var chartData = [{
                name: '현대',
                data: [2500, 3000, 4000, 3000, 3700, 2800, 5000, 7500, 3400, 2200, 1300, 1000],
                stack: '0' /* stack이 데이터값을 분류해줍니다. */
            }, {
                name: '기아',
                data: [2400, 2500, 3000, 2800, 4000, 3200, 4800, 6100, 2800, 2000, 1400, 1200],
                stack: '0'
            }, {
                name: '테슬라',
                data: [2800, 3000, 2900, 3100, 2500, 3400, 5000, 5500, 6700, 7000, 7700, 6500],
                stack: '0'
            }, {
                name: '현대1',
                data: [2500, 3000, 4000, 3000, 3700, 2800, 5000, 7500, 3400, 2200, 1300, 1000],
                stack: '1',
                showInLegend: true /* 범례에 표시하지 않음. */
            }, {
                name: '기아1',
                data: [2500, 3000, 4000, 3000, 3700, 2800, 5000, 7500, 3400, 2200, 1300, 1000],
                stack: '1',
                showInLegend: true
            }, {
                name: '테슬라1',
                data: [2500, 3000, 4000, 3000, 3700, 2800, 5000, 7500, 3400, 2200, 1300, 1000],
                stack: '1',
                showInLegend: true
            }, {
                name: '아날로그 반도체',
                type: 'line',
                yAxis: 1,
                /* 두번째 y축 선택 */
                data: [9800, 9500, 9750, 7000, 6830, 6000, 3200, 3100, 2840, 2700, 2230, 1400],
                tooltip: {
                    valueSuffix: ' EA'
                },
                dataLabels: {
                    enabled: true /* 데이터라벨 표시 */
                },
                label: {
                    enabled: false /* 라인그래프에 라벨 숨기기 */
                }
            }]